# Thickness Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalyticalPanel..::..Thickness Property
AnalyticalPanel Class See Also
---
Panel thickness, in the Revit default units.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public double Thickness { get; set; }
```

Visual Basic
---
```text
Public Property Thickness As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double Thickness {
	double get ();
	void set (double value);
}
```

# See Also
AnalyticalPanel Class
Autodesk.Revit.DB.Structure Namespace